package helper

import (
	"strings"
)

var name string = "十步殺一人,床前脫光光,千首觀陰,我愛大波蓮,長腿叔叔,叔叔北行鳥,我愛你老母,打卡小生,菠蘿包,鐵鳩船長,瀉乳淫僧,同志三分親,借叔一簫,北姑十二樂坊,小明最靚仔,廣州老母雞,萬里望花生,膠液現牆,品學兼憂,玩撚猿,牙齒當鳩洗,直陽在西,乳滴桐痕,吹拮鼻胸,四條女點夠隊,奔走好很遠,豐乳同露,緊急式,原本琴日香,頭號炮友,觀音坐連,游詠富,黑過牛肺,牛柏葉,奶他,維他奶,賓周,皮蛋黃,跌親都唔怕,無法顯示人物名稱,銅鑼灣扛報紙,汗味戰警,左青龍右胖虎,靈車甩尾棺材飛,媽你看爸在飛,怕滑落地,頭蚊子叮,紅衣小男孩,九頭龍閃到腰,善解人衣,剛好五個字,打死我也不說,媽媽來了快關電腦,怪很強我先走,差一元買多多,說好不打臉,不要問,你會怕,拉鍊裡的猛獸,你看不見我,轉角遇到怪,放個屁就,你點到我了,抱歉沒點補,網路連線中斷,拿佛珠砸耶穌,你已經死了,綠油精點眼睛,屎亡筆記本,關完大哥關二哥,放屁給你聞,你在大聲什麼啦,蒙奇D能兒,名子剛好七個子,苗栗小五郎,AI人工智障,放屁給你聞,蒙其D罩杯,老公我要硬漢,田邊控韓幾,老爺不可以,夫人會生氣,叔叔不可以,爺爺不可以,新資料夾,新資料夾(2),新增文字文件,新細明體,悲傷滷肉飯,憂鬱肉燥飯,抒情控肉飯,沒有人,謝謝,不客氣,被冰塊燙傷,麻辣白開水,涼麵趁熱吃,睡在地上比你高"
var arrName []string

func init() {
	arrName = strings.Split(name, ",")
}

func GetName() string {
	idx := rangeIn(0, len(arrName)-1)

	return arrName[idx]

}
